OFtutorialTest04_MRF/rhoSimpleFoam/turbine/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInlet      50;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{

    INFLOW
    {
        type            inletOutlet;
        inletValue      uniform $omegaInlet;
        value           uniform $omegaInlet;
    }
    OUTFLOW
    {
        type            inletOutlet;
        inletValue      uniform $omegaInlet;
        value           uniform $omegaInlet;
    }
    
    BLADE
    {
        type            omegaWallFunction;
        value           uniform $omegaInlet;
    }

    HUB
    {
        type            omegaWallFunction;
        value           uniform $omegaInlet;
    }
    
    SHROUD
    {
        type            omegaWallFunction;
        value           uniform $omegaInlet;
    }
    
    PER1
    {
        type            cyclicAMI;
    }
    
    PER2
    {
        type            cyclicAMI;
    }
    
    #includeEtc "caseDicts/setConstraintTypes"    
    
}


// ************************************************************************* //
